<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"a5dd557c05b11af7fc056d35535e0f1c4b77140808d8b5b7bec432ec612130b4","plan_job_ref":"Job .github/workflows/_test-tf.yaml #270 at https://github.com/tx-pts-dai/github-workflows/actions/runs/13327469094","plan_out_hash":"2e8fc022723f9b168f9368e14014a1fe096c0f2018ca244a9497c794065a9410","plan_hash":"15170cef7d2a178b5bc399cb710e1d4af73c7adfa3d979c56e8e99f071ab57b5","plan_text_format":"diff","version":"1.45.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #270](https://github.com/tx-pts-dai/github-workflows/actions/runs/13327469094)